---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.Delete
zh: 删除、移除
source: html/f3fc20a7-9cbb-e9c2-0894-b4c9277ac4d1.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.Delete Method

**中文**: 删除、移除

Deletes the handle.

## Syntax (C#)
```csharp
public void Delete()
```